{"meta":{"title":"SubmitHealth","subtitle":"Blog","description":null,"author":"SubmitHealth","url":"http://blog.submithealth.com"},"pages":[],"posts":[{"title":"SubmitHealth Authorizations for Record Release","slug":"SubmitHealth-Authorizations-for-Record-Release","date":"2017-04-12T03:06:13.000Z","updated":"2017-04-12T03:50:36.964Z","comments":true,"path":"2017/04/11/SubmitHealth-Authorizations-for-Record-Release/","link":"","permalink":"http://blog.submithealth.com/2017/04/11/SubmitHealth-Authorizations-for-Record-Release/","excerpt":"","text":"By: Andrew Akagawa This article is the first in a series of posts that we will be publishing to demo simple tools that help streamline administrative and marketing tasks for your practice. If you’re interested in keeping up to date with our features and services, please subscribe! How This HelpsOur record request service is one of the first ideas my co-founder, Kevin, approached me with when we founded SubmitHealth. One of the frustrations he had encountered at his practice was the manual and slow nature of the record request process. He, like many other providers, has a patient portal, but had found it generally useless as many requesters are not very tech-savy, and don’t want to seek out a patient portal, nor do they want to navigate a non-user friendly environment. Hence, the process had reverted to the typical horrendous use of phone calls and faxes. So, here was the general and painful workflow: Patient or patient representative calls to request a record Practice directs them to an online downloadable pdf authorization form Patient or patient representative completes the form and faxes, mails, or delivers the form Practice processes the request Practice initiates follow up administrative billing for larger records that are faxed or mailed Patient or patient representative mails payment Practice deposits payment The whole process can take several months, and often leaves all parties involved somewhat dissatisfied. SubmitHealth provides patients the ability to authorize the release of records onlineHere’s a quick demo for how this tool works for both patients and providers: With this tool, our workflow is simplified to: Patient or patient representative finds or is directed to the online authorization form. Patient or patient representative submits the online form, capturing info and credit card payment. Practice processes the request This process has helped to dramatically simplify the workflow at Kevin’s practice. Furthermore, it has proven a really great tool to work on behalf of patients to request their records in a simple and timely manner. If this service resonates with you, please feel free to contact us to learn more or to implement at your practice. Also, please subscribe by clicking here to stay up to date with future tools and information.","categories":[{"name":"Demos & Tutorials","slug":"Demos-Tutorials","permalink":"http://blog.submithealth.com/categories/Demos-Tutorials/"}],"tags":[{"name":"Administrative Tools","slug":"Administrative-Tools","permalink":"http://blog.submithealth.com/tags/Administrative-Tools/"}],"keywords":[{"name":"Demos & Tutorials","slug":"Demos-Tutorials","permalink":"http://blog.submithealth.com/categories/Demos-Tutorials/"}]},{"title":"Is TrumpCare Just a Band-Aid?  Three Root Causes Worth Investigating Before Repeal and Replace.","slug":"Is-AHCA-Just-a-Band-Aid-Three-Root-Causes-Worth-Investigating-Before-Repeal-and-Replace","date":"2017-03-19T18:42:34.000Z","updated":"2017-04-12T03:24:04.440Z","comments":true,"path":"2017/03/19/Is-AHCA-Just-a-Band-Aid-Three-Root-Causes-Worth-Investigating-Before-Repeal-and-Replace/","link":"","permalink":"http://blog.submithealth.com/2017/03/19/Is-AHCA-Just-a-Band-Aid-Three-Root-Causes-Worth-Investigating-Before-Repeal-and-Replace/","excerpt":"","text":"By: Andrew Akagawa Obamacare has had its issues, and Washington is in a frenzy trying to put together a new healthcare bill, but are these efforts really aimed at solving the causes of our healthcare problems, or are they just shuffling things around? No matter which way you split it, healthcare is ridiculously costly, and it seems like there’s just not enough money to go around. So rather than focussing massive efforts on how to insure people, why not focus more directly on how to lower the cost of care? In early February, Sanders and Cruz debated the topic on CNN, both from drastically different viewpoints, however it was amazing how much they seemed to agree on many of the systemic issues that are driving up costs. If we can work together on some of these issues, we could probably make some major progress regardless of how public healthcare is delivered. So here are three areas that we believe should be investigated before anything else: 1. Enough of Insurance Companies ProfitingHigh profiting insurance companies are absurd. Americans are now legally mandated to have insurance and punished on our income taxes if we cannot afford this. We have no choice but to give our money to insurance companies in return for our healthcare. So why the should they be entitled to any profit? The whole scenario is a dangerous precedent for insurance companies to make some very easy money. If insurance companies have a surplus of cash, then it’s time for them to lower premiums and deductibles, and stop rationing care. Otherwise, maybe it’s time we tax insurance company profits more aggressively. If that’s too left of center, then maybe the government should just endorse and help grow some of the most competitive non-profits to help drive market costs down. Whichever means to get there, our money should be reserved for our healthcare, and not for the profits of insurers. 2. Evaluate Bureaucracy from Government AgenciesRegulation from FDA and HHS has served an important role in delivering safe and effective care, however over the course of several years legislation has become heavy and ineffective in keeping up with rapid technology changes. Before we scrutinize a healthcare bill, maybe we should review and optimize FDA and HIPAA legislation. In doing so, we should be asking if the legislation doing it’s job? Is it overly inhibiting to practices or new technologies such that the inhibitions do not outweigh the benefits and risks? How can we better clarify legislation for new technology companies to create safe and effective disruptions in healthcare that can lower costs for all? 3. Curb Pharmaceutical GreedUnderstandably, drug companies need to be able to profit from the risks and efforts that they endure when developing new drugs, but how much is too much? A post published by consummerreports.org comments on the greed of CEOs like Martin Shkreli, raising the price of Daraprim, a treatment for toxoplasmosis associated with HIV and cancer, from $13.50 to $750 per pill. Setting a drug pricings has now come down to asking what’s the dollar value of a human life. There must be a more reasonable middle grounds, where drug executives have the opportunity to get rich enough, while others can still afford treatment. The post goes on to explain how government can help, including imposing out-of-pocket cost limits, better facilitating the release of generic drugs, and allowing for drug importation, which is currently illegal in the US. One approach that both Sanders and Cruz could agree on, is to allow for Medicare to negotiate prices with industry. In summary, Obamacare is certainly not the cause of all of our healthcare problems, nor does Trumpcare seem to be the solution. The true cause of our healthcare problems is simply the cost of care. It’s furthermore disappointing that we, as one of the most innovative countries in the world, have not been able to solve this yet. However, we can hopefully remain optimistic that the issue of high costs is largely non-partisan, and look to the future for what we can come up with going forward. SubmitHealth - Grow Your Practice. Websites | Online Marketing | Administrative Tools","categories":[],"tags":[{"name":"Affordable Care","slug":"Affordable-Care","permalink":"http://blog.submithealth.com/tags/Affordable-Care/"},{"name":"AHCA","slug":"AHCA","permalink":"http://blog.submithealth.com/tags/AHCA/"}],"keywords":[]},{"title":"Three Simple Tips to Help Your Practice in a Digital Age","slug":"Three-Simple-Tips-to-Help-Your-Practice-in-a-Digital-Age","date":"2016-12-16T02:46:27.000Z","updated":"2016-12-16T05:09:18.908Z","comments":true,"path":"2016/12/15/Three-Simple-Tips-to-Help-Your-Practice-in-a-Digital-Age/","link":"","permalink":"http://blog.submithealth.com/2016/12/15/Three-Simple-Tips-to-Help-Your-Practice-in-a-Digital-Age/","excerpt":"","text":"1. Have a Kickass WebsiteYou need a websiteIf you do not have a website, you are not being seen. A recent survey published on mobilehealthnews.com reported that Fifty-four percent of young millennials (aged 18 to 24) say they search online for health information and rely on online physician ratings before seeing a doctor.Let’s face it, we are living in a unique era where healthcare is intersecting with technology like never before. If you’re still holding out on a website, you will be forgotten. Is your site working for you and your patients?There are certain key features that you must highlight well. Upon visiting your website, a patient should instantly be able to find how to schedule an appointment, where you are located, and how to call you. You should also consider helpful services like online forms and bill pay. Does your website look professional?Your website is the storefront that reflects your practice, hence it should look clean and professional. Less is more! You may showcase your core services and staff, but take care not to clutter your site, making it hard for users to find important info, like how to contact you.Ensure your website looks like it was built in this decade. The internet has drastically changed since it was first conceived. Your website should be nicely viewable and useable on cell phones and tablets. It should also have high quality images that reflect your practice. 2. Manage and Sustain Your Web PresenceKeep your listings up to dateNot so long ago, I made an appointment with an allergist. I used Google Maps to find and route me to the practice, only to find that the practice had moved a few months ago and I was in the wrong location. Hence, its becoming more and more important to stay on top of your web presence and maintain your brand as a healthcare provider. Keep your business listing up to date with Google, Yelp, and other websites to ensure your online identity stays maintained. Keep your social medias up to dateSocial medias such as Facebook, Twitter, and Instagram are another great way to promote your business, and share useful information about your practice. Not sure where to start? Try doing just one of these well. A Facebook page is a great starting point. Feel free to leverage your more trusted and extroverted staff to help create content, but just remember to be careful not to violate any HIPAA rules. 3. Have a Friendly StaffLast but not least, this is one of the most important things you can have to help ensure success in your practice. After the incident with my allergist that I spoke about above, I remember calling the office in confusion, trying to figure out where to find them. I was already very late, and they told me to come in anyway, but the staff was somewhat rude and annoyed by the whole ordeal. The doctor was kind and very effective in treating me, but the whole experience left me in a state where I did not want to go back. Many practices today still remain frustrated with the growth of social media, and their resistance to such changes is understandable. How could patients so quickly judge the complexities of medicine without an understanding of the deep medical sciences that doctors have devoted years of their lives to. But, when you look at patient reviews, often the negative ones have little to do with the effectivity of a treatment, and a lot more to do with their interactions with patients. Your staff is part of your brand, and that is no different than how things were 50 years ago. Before social medias, word of mouth within a community went a long way in establishing a doctor’s reputation, for better or worse. The main difference today is that word of mouth travels much faster than it ever did before. Let’s face it, social medias are here to stay, and how you appear on them will go a long way to help or hurt your business. It’s bedside mannor 2.0 and you need it to survive. The good news is that all you have to do is be nice! Thank you for reading and please feel free to comment and share your tips or thoughts below. Andrew AkagawaWriter, Coder, Healthcare Nerd Image courtesy of StockSnap.io","categories":[],"tags":[{"name":"Healthcare Management","slug":"Healthcare-Management","permalink":"http://blog.submithealth.com/tags/Healthcare-Management/"}],"keywords":[]}]}