{"meta":{"title":"SubmitHealth","subtitle":"Blog","description":null,"author":"SubmitHealth","url":"http://blog.submithealth.com"},"pages":[],"posts":[{"title":"Picking A Medical Insurance Plan","slug":"Picking-A-Medical-Insurance-Plan","date":"2016-08-03T04:57:03.000Z","updated":"2016-08-04T06:52:14.489Z","comments":true,"path":"2016/08/03/Picking-A-Medical-Insurance-Plan/","link":"","permalink":"http://blog.submithealth.com/2016/08/03/Picking-A-Medical-Insurance-Plan/","excerpt":"","text":"Only you can decide the insurance that is right for you, but here are some thoughts that can hopefully help. So What the Heck is Insurance Really?Medical insurance is sort of one step shy of that shady mob boss that provides protection. They skim a little out of your paycheck, sometimes go off and gamble with it in various investments, hut ultimately in return provide some help to you should you encounter unfortunate health circumstances. How happy you feel about the whole relationship is for you to decide.Medical insurance is designed to be extremely confusing, but in all it simply boils down to splitting the cost of your medical expenses between yourself, the insurance company, often your employer, and sometimes the government. They do this in a mix of different and complicated healthcare plans that all break everything down in their own unique way. Some Things to Note FirstFirst off there are a lot of overly complicated terms you should know when selecting an insurance. Here’s the breakdown if you don’t already know them: Premium:This is typically the fee you will pay per paycheck, or maybe a monthly fee if you are self-employed. Its the cyclical fee that you pay for your healthcare. Copay:In addition to your ongoing fees, a copay is at least some of the bill that you will pay each time you see a doctor. Insurance won’t pay for all of it without you having some skin in the game, or else you could be at the doctor every week with any ache or pain. Hense, they want you to pay for at least some of your doctor visits. Deductable:Watch out for this one! Your insurance won’t pay anything until your expenses reach this amount. So if your deductable is $1000, your insurance really won’t pay anything until you first have at least paid $1000 in medical expenses, typically for the year. Some plans are only designed to help you for when crap really hits the fan, but if you spend far less than the deductable on healthcare per year, you may feel cheated that after all those premiums you’ve paid, your healthcare still really covered non of your doctor visits. Max Out of Pocket:This is the total amount you should ever pay for healthcare typically per year. If you max out of pocket expenses is $3000, then once you have personally paid that much in healthcare expenses per year, you insurance should cover all of your remaining healthcare expenses for that year. Personal expenses include the 100% of expenses you’ve paid to reach your deductable, plus the fraction of expenses you’ve paid after you’ve reached your deductable. In or Out of Network:The network is really just an ambiguous group of doctors that the insurance has sort of partnered with. If you go to a doctor in the network, the insurance company feels confident enough to pay more for your visit and you will pay less. If you choose someone outside you will pay more or maybe even all of the cost of the visit. I say ambiguous because it always seems very difficult to tell whether a doctor is in or out of the network. When in doubt, call that number on your insurance card and double check, which brings us to the next important section. Whenever In Doubt, Call Your InsuranceAnnoy or become BFFs with your insurance customer service reps. I cannot emphasize this enough as it can save you money! If you are not sure the doctor, urgent care, or hospital facility is covered, call and double check with these guys. Make sure you hear from them how much they will cover. Never trust the healthcare plan or system to work right, and double check any bill that you receive. All too often I have received bills stating what I owe, only to call and hear from the insurance that they should be paying this. Understanding Your QuotesWhen choosing your healthcare plan you will see a cost breakdown for the general catagories of healthcare visits. Some will be a dollar value and others often a percentage. Some are self explanatory, but here’s the breakdown. Preventative Care:A general checkup. Hopefully this should cost zero. Out Patient:This is generally when you seeing a practice outside the hospital (e.g. doctor or lab visits). In Patient:This is generally for when you are in the hospital. Maturnity:General costs of having a baby! Watch out as there may be special instructions here, like you must notify your insurance within a few months of pregnancy. Emergency Room:The cost of going to the emergency room, and its generally pricey, so if you think your condition is not an emergency, be sure to try an Urgent Care center first. Urgent Care:Cost to go to an urgent care facility. Prescription Drugs:Cost of drugs. The Typical Healthcare OptionsMore Traditional Healthcare Plans:These are the standard, age old insurance options. HMO (Health Maintenance Organization)This is typically a more all inclusive plan. What’s great about them is that they’re typically lower in costs. General doctors, specialists, labs, hospitals, and pharmacies band together to try and reduce costs. What sucks about them is that sometimes it feels they reduce costs a little too much. They often wont cover anything more cosmetic, and they are extremely bureaucratic. Before you can the actual healthcare you need, you’ll need permission, from a primary care doctor, and your insurance, and you’ll really only be able to see whoever they work with. You’ll basically sacrafice your healthcare time and options for a discount in price. PPO (Preferred Provider Organization)This is sort of the opposite of an HMO. You can see generally whoever you like! Go straight to the specialists and have coverage for generally much more. The catch - these are generally much more expensive in premiums. Also be carefull of knowing in vs. out of network, and your deductable. Your cost could go say from 20% to 80% or more if out of network, and 100% if you haven’t hit your deductable. Common Consumer Healthcare Plans:We like consumer healthcare options as it let’s you decide more on what types of healthcare options you want to buy, and evaluate the value you are getting from them. Even better yet, the money is usually pre-tax so Uncle Sam won’t skim off your medical expenses! HRA (Health Reimbursement Arrangement)I personally like this option. Its generally a sort of high deductable PPO with cheaper premiums. So what does that mean? You get to see who you want to see, pay a reasonable monthly fee. Your insurance won’t really cover anything until you’ve paid alot out of pocket, but what makes it all worth while is that your employer will reimburse you a good chunk of the money. Maybe around $500 for youself or $1500 for your family depending on your insurance. So you’ll pay nothing for the first portion of your healthcare expenses for the year. My experience is that the process is all quite automated so reimbursments aren’t a painful process of forms or anything like a crappy appliance rebate. You’ll just pay nothing until you’ve reached the reimbursement amount and the insurance takes care of the reimbursement allocation. After that, you’ll pay for everything until you hit your deductable, but good news… the reimbursement amount counts toward your deductable. So if you run the numbers, even if you have so many healthcare expenses to reach your deductable, you’ll still probably pay about the same as if you choose a PPO with higher monthly premiums. This is a great choice if you don’t see a doctor often (e.g. 2 - 3 times a year). If you stay under the reimbursement amount for the year, you’ll pay nothing, and the money left over often rolls over to the next year. HSA (Health Savings Account)Another good consumer healthcare option. Very similar to the HRA, but instead of a reimbursement, you employer just sort of gives you a certain dollar value per year and puts it into a savings account for you. It usually becomes a personal bank account for you that you will keep even after you leave the plan. Unused money rolls over and also collects interest. FSA (Flexible Spending Account)This is not really a healthcare plan but still deserves to be mentioned. It usually goes along with your healthcare plan. FSAs give you the option to allocate pre-taxed money from your paycheck for the yearly medical expenses. Sounds good but there’s a catch… If you don’t use the money by the end of the year, your employer will take it from you. That’s a sort of red flag that I’ve never been able to get over. If you think you can predict and manage your expenses well, this may be a good way to save a few tax dollars. For me, its not worth the headache. Closing ThoughtsUltimately the choice of healthcare is yours alone to decide, and be mindfull that all plans are a little different and may not perfectly match this post. Also, regardless of what you choose, its good to know the costs of your visits, which is still strangely so non-transparent. So do ask your providers for quotes, and always question your insurance when it comes to weird bills! Thanks for reading and feel free to subscribe or follow us on social medias! Subscribe to Email Updates Credits:Image courtesy of Maialisa on Pixabay","categories":[],"tags":[{"name":"Insurance, ConsumerHealth,","slug":"Insurance-ConsumerHealth","permalink":"http://blog.submithealth.com/tags/Insurance-ConsumerHealth/"}]},{"title":"Hi Friends!","slug":"welcome-friends","date":"2016-08-03T04:54:06.913Z","updated":"2016-08-02T06:06:44.577Z","comments":true,"path":"2016/08/03/welcome-friends/","link":"","permalink":"http://blog.submithealth.com/2016/08/03/welcome-friends/","excerpt":"","text":"Welcome to the SubmitHealth blog. As our first post I thought I would share the overall goals and values of this blog. So, why we are here?We’re here to help in the search of healthcare that is: Cost effective Time effective Get’s you patched up effectively! In short, we seek Effective Healthcare.For many of us here, our experience with the healthcare system can be summarized by: Lots of money spent Often no real resolve to healthcare issues Major takeaway… See a doctor only when symptoms include verge of death Our hope is that it does not have to be this way. And we get it, understandably there isn’t a magical solution to solve everyone’s discomfort at any given moment, that is until they finally get that tricorder working. But until then, our hope is to find and share practical solutions for getting healthcare delivered more effectively. So stay tuned, and thank you for reading. Best Regards, Andrew AkagawaWriter, Coder, Healthcare Nerd Stay Healthy, Stay HappyImage courtesy of SplitShire","categories":[],"tags":[{"name":"Introduction","slug":"Introduction","permalink":"http://blog.submithealth.com/tags/Introduction/"},{"name":"About","slug":"About","permalink":"http://blog.submithealth.com/tags/About/"},{"name":"Effective","slug":"Effective","permalink":"http://blog.submithealth.com/tags/Effective/"}]}]}