{"meta":{"title":"SubmitHealth","subtitle":"Blog","description":null,"author":"SubmitHealth","url":"http://blog.submithealth.com"},"pages":[],"posts":[{"title":"Three Simple Tips to Help Your Practice in a Digital Age","slug":"Three-Simple-Tips-to-Help-Your-Practice-in-a-Digital-Age","date":"2016-12-16T02:46:27.000Z","updated":"2016-12-16T05:09:18.908Z","comments":true,"path":"2016/12/15/Three-Simple-Tips-to-Help-Your-Practice-in-a-Digital-Age/","link":"","permalink":"http://blog.submithealth.com/2016/12/15/Three-Simple-Tips-to-Help-Your-Practice-in-a-Digital-Age/","excerpt":"","text":"1. Have a Kickass WebsiteYou need a websiteIf you do not have a website, you are not being seen. A recent survey published on mobilehealthnews.com reported that Fifty-four percent of young millennials (aged 18 to 24) say they search online for health information and rely on online physician ratings before seeing a doctor.Let’s face it, we are living in a unique era where healthcare is intersecting with technology like never before. If you’re still holding out on a website, you will be forgotten. Is your site working for you and your patients?There are certain key features that you must highlight well. Upon visiting your website, a patient should instantly be able to find how to schedule an appointment, where you are located, and how to call you. You should also consider helpful services like online forms and bill pay. Does your website look professional?Your website is the storefront that reflects your practice, hence it should look clean and professional. Less is more! You may showcase your core services and staff, but take care not to clutter your site, making it hard for users to find important info, like how to contact you.Ensure your website looks like it was built in this decade. The internet has drastically changed since it was first conceived. Your website should be nicely viewable and useable on cell phones and tablets. It should also have high quality images that reflect your practice. 2. Manage and Sustain Your Web PresenceKeep your listings up to dateNot so long ago, I made an appointment with an allergist. I used Google Maps to find and route me to the practice, only to find that the practice had moved a few months ago and I was in the wrong location. Hence, its becoming more and more important to stay on top of your web presence and maintain your brand as a healthcare provider. Keep your business listing up to date with Google, Yelp, and other websites to ensure your online identity stays maintained. Keep your social medias up to dateSocial medias such as Facebook, Twitter, and Instagram are another great way to promote your business, and share useful information about your practice. Not sure where to start? Try doing just one of these well. A Facebook page is a great starting point. Feel free to leverage your more trusted and extroverted staff to help create content, but just remember to be careful not to violate any HIPAA rules. 3. Have a Friendly StaffLast but not least, this is one of the most important things you can have to help ensure success in your practice. After the incident with my allergist that I spoke about above, I remember calling the office in confusion, trying to figure out where to find them. I was already very late, and they told me to come in anyway, but the staff was somewhat rude and annoyed by the whole ordeal. The doctor was kind and very effective in treating me, but the whole experience left me in a state where I did not want to go back. Many practices today still remain frustrated with the growth of social media, and their resistance to such changes is understandable. How could patients so quickly judge the complexities of medicine without an understanding of the deep medical sciences that doctors have devoted years of their lives to. But, when you look at patient reviews, often the negative ones have little to do with the effectivity of a treatment, and a lot more to do with their interactions with patients. Your staff is part of your brand, and that is no different than how things were 50 years ago. Before social medias, word of mouth within a community went a long way in establishing a doctor’s reputation, for better or worse. The main difference today is that word of mouth travels much faster than it ever did before. Let’s face it, social medias are here to stay, and how you appear on them will go a long way to help or hurt your business. It’s bedside mannor 2.0 and you need it to survive. The good news is that all you have to do is be nice! Thank you for reading and please feel free to comment and share your tips or thoughts below. Andrew AkagawaWriter, Coder, Healthcare Nerd Image courtesy of StockSnap.io","categories":[],"tags":[{"name":"Healthcare Management","slug":"Healthcare-Management","permalink":"http://blog.submithealth.com/tags/Healthcare-Management/"}],"keywords":[]}]}